Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/1.1.156/samc20/edc/ATSAMC20G15A.PIC
      <edc:SFRDef edc:access="n----nnn" edc:addr="0x42001016" edc:cname="INTENSET" edc:impl="0x87" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="PREC" edc:desc="Stop Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMATCH" edc:desc="Address Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n----nnn" edc:addr="0x42001018" edc:cname="INTFLAG" edc:impl="0x87" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="PREC" edc:desc="Stop Received Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMATCH" edc:desc="Address Match Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----nn-nn-nnnnn" edc:addr="0x4200101A" edc:cname="STATUS" edc:impl="0x6DF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="BUSERR" edc:desc="Bus Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLL" edc:desc="Transmit Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXNACK" edc:desc="Received Not Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Read/Write Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR" edc:desc="Repeated Start" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LOWTOUT" edc:desc="SCL Low Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKHOLD" edc:desc="Clock Hold" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SEXTTOUT" edc:desc="Slave SCL Low Extend Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HS" edc:desc="High Speed" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------------rr" edc:addr="0x4200101C" edc:cname="SYNCBUSY" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SERCOM Enable Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="SERCOM2/I2CM">
      <edc:SFRDef edc:access="-nnnn-nnnnnn---n--------n--nnnnn" edc:addr="0x42000C00" edc:cname="CTRLA" edc:impl="0x7BF1009F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM2">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="USART_EXT_CLK" edc:desc="USART with external clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="USART_INT_CLK" edc:desc="USART with internal clock" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI in slave operation" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI in master operation" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="I2C_SLAVE" edc:desc="I2C slave operation" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="I2C_MASTER" edc:desc="I2C master operation" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PINOUT" edc:desc="Pin Usage" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDAHOLD" edc:desc="SDA Hold Time" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="75NS" edc:desc="50-100ns hold time" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="450NS" edc:desc="300-600ns hold time" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="600NS" edc:desc="400-800ns hold time" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MEXTTOEN" edc:desc="Master SCL Low Extend Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEXTTOEN" edc:desc="Slave SCL Low Extend Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="Transfer Speed" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="STANDARD_AND_FAST_MODE" edc:desc="Standard Mode(Sm) Upto 100kHz and Fast Mode(Fm) Upto 400kHz " edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FASTPLUS_MODE" edc:desc="Fast-mode Plus Upto 1MHz" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_SPEED_MODE" edc:desc="High-speed mode Upto 3.4MHz" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCLSM" edc:desc="SCL Clock Stretch Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INACTOUT" edc:desc="Inactive Time-Out" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="55US" edc:desc="5-6 SCL Time-Out(50-60us)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="105US" edc:desc="10-11 SCL Time-Out(100-110us)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="205US" edc:desc="20-21 SCL Time-Out(200-210us)" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOWTOUTEN" edc:desc="SCL Low Timeout Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------nnn------nn--------" edc:addr="0x42000C04" edc:cname="CTRLB" edc:impl="0x70300" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM2">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="Smart Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QCEN" edc:desc="Quick Command Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ACKACT" edc:desc="Acknowledge Action" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnnnnn--nnnnnnnnnnn" edc:addr="0x42000C24" edc:cname="ADDR" edc:impl="0xFFE7FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM2">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address Value" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENEN" edc:desc="Length Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HS" edc:desc="High Speed Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TENBITEN" edc:desc="Ten Bit Addressing Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LEN" edc:desc="Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
